In [1]:
import numpy as np
import pandas as pd
from sklearn import svm
from sklearn.svm import SVR
from scipy.stats import mode as mode

In [2]:
data = pd.read_csv('titanic_data_set.csv')

In [3]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
data['Sex'] = data['Sex'].map({'female':1,'male':0})

In [5]:
data['Age'].fillna(mode(data['Age']).mode[0],inplace = True)

In [6]:
data.shape

(891, 12)

In [7]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [8]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S

In [9]:
feature = data.iloc[:, [2,4,5,9]]
feature.head()

   Pclass  Sex   Age     Fare
0       3    0  22.0   7.2500
1       1    1  38.0  71.2833
2       3    1  26.0   7.9250
3       1    1  35.0  53.1000
4       3    0  35.0   8.0500

In [10]:
feature.shape

(891, 4)

In [11]:
label = data['Survived']
label = label.values.reshape(-1,1)

In [12]:
from sklearn.preprocessing import StandardScaler
sc_X = StandardScaler()
feature = sc_X.fit_transform(feature)

In [13]:
reg = SVR()
reg.fit(feature, label)

E:\Suban\Anaconda\lib\site-packages\sklearn\utils\validation.py:760: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

SVR(C=1.0, cache_size=200, coef0=0.0, degree=3, epsilon=0.1, gamma='scale',
    kernel='rbf', max_iter=-1, shrinking=True, tol=0.001, verbose=False)

In [14]:
reg.score(feature, label)

0.42051298102498436

In [15]:
from sklearn.model_selection import train_test_split

feature_train, feature_test, label_train, label_test = train_test_split(feature, label, test_size = 0.2)

In [16]:
reg.fit(feature_train, label_train)

E:\Suban\Anaconda\lib\site-packages\sklearn\utils\validation.py:760: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

SVR(C=1.0, cache_size=200, coef0=0.0, degree=3, epsilon=0.1, gamma='scale',
    kernel='rbf', max_iter=-1, shrinking=True, tol=0.001, verbose=False)

In [17]:
reg.score(feature_train, label_train)

0.4548725957061796

In [18]:
label_pred = reg.predict(feature_test)

In [19]:
from sklearn.metrics import r2_score

In [20]:
r2_score(label_pred, label_test)

-0.4539470271684585

In [21]:
data2 = pd.read_csv("titanic_data_set.csv")

In [22]:
data2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [23]:
data2['Sex'] = data2['Sex'].map({'female':1, 'male': 0})

In [24]:
data2['Age'].fillna(mode(data2['Age']).mode[0], inplace = True)

In [25]:
data2.shape

(891, 12)

In [26]:
data2.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [27]:
feature2 = data2.iloc[:, [2,4,5,9]]
label2 = data2['Survived']

In [28]:
sc_X2 = StandardScaler()

In [29]:
feature2 = sc_X2.fit_transform(feature2)

In [30]:
reg2 = svm.SVC()

In [31]:
reg2.fit(feature2, label2)

SVC(C=1.0, break_ties=False, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma='scale', kernel='rbf',
    max_iter=-1, probability=False, random_state=None, shrinking=True,
    tol=0.001, verbose=False)

In [32]:
reg2.score(feature2, label2)

0.8159371492704826

In [33]:
feature_train2, feature_test2, label_train2, label_test2 = train_test_split(feature2, label2, test_size = 0.2)

In [34]:
reg2.fit(feature_train2, label_train2)

SVC(C=1.0, break_ties=False, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma='scale', kernel='rbf',
    max_iter=-1, probability=False, random_state=None, shrinking=True,
    tol=0.001, verbose=False)

In [35]:
reg2.score(feature_train2, label_train2)

0.8188202247191011

In [36]:
label_pred = reg2.predict(feature_test2)

In [37]:
r2_score(label_pred, label_test2)

0.16011730205278607